---
kind: method
id: M:Autodesk.Revit.DB.ElementArray.#ctor
source: html/cfde1a4e-c606-5ed4-fb1c-220ae1a73313.htm
---
# Autodesk.Revit.DB.ElementArray.#ctor Method

Initializes a new instance of the ElementArray class

## Syntax (C#)
```csharp
public ElementArray()
```